SET NAMES UTF8;
DROP DATABASE IF EXISTS hz;
#创建数据库hz
CREATE DATABASE hz CHARSET=UTF8;
USE hz;

#创建用户表
CREATE TABLE user (
  uid INT PRIMARY KEY AUTO_INCREMENT,
  uname VARCHAR(30) UNIQUE,
  upwd VARCHAR(32),
  phone TINYINT(11) UNIQUE,
  email VARCHAR(64),
  gender BOOL ,
  birthday DATE,
  userName VARCHAR(12) NOT NULL
);
#插入测试数据
INSERT INTO user VALUE
(NULL,'admin','123456','18833669988','123@qq.com',0,'1996-3-10','xiannv');

#创建新闻表
CREATE TABLE news(
  nid INT PRIMARY KEY AUTO_INCREMENT,
  ntitle VARCHAR(64),
  ncontent VARCHAR(1000),
  nuser VARCHAR(8),
  ndate DATE
);
#插入测试数据
INSERT INTO news VALUE
(NULL,'测试新闻','测试新闻内容','admin','2018-12-6');
#创建公告表
CREATE TABLE inform(
  iid INT PRIMARY KEY AUTO_INCREMENT,
  ititle VARCHAR(64),
  icontent VARCHAR(1000),
  iuser VARCHAR(8),
  idate DATE
);
#插入测试数据
INSERT INTO inform VALUE
(NULL,'测试公告','测试公告内容','admin','2018-12-6');
#创建活动表
CREATE TABLE activity(
  aid INT PRIMARY KEY AUTO_INCREMENT,
  atitle VARCHAR(64),
  acontent VARCHAR(1000),
  auser VARCHAR(8),
  adate DATE
);
#插入测试数据
INSERT INTO activity VALUE
(NULL,'测试活动','测试活动内容','admin','2018-12-6');

#创建角色表
CREATE TABLE role(
  rid INT PRIMARY KEY AUTO_INCREMENT,
  rname VARCHAR(30),
  rage VARCHAR(30),
  rgender BOOL,
  occupation VARCHAR(30),
  hometown VARCHAR(30),
  hobby VARCHAR(30),
  dream VARCHAR(30),
  nut VARCHAR(30),
  worth VARCHAR(20),
  detail VARCHAR(200)
);
#插入数据
INSERT INTO role VALUE
('NULL','蒙奇·D·路飞','19岁',1,'草帽海贼团船长','东海·风车村','喜欢探险，感兴趣于新奇怪异的事物','找到ONE PIECE，并成为海贼王','超人系橡胶果实','15亿','由于他的标志性特征是一顶草帽，因此常被直接称呼为“草帽”。梦想是找到传说中的ONE PIECE，成为海贼王。性格积极乐观，爱憎分明且十分重视伙伴，对任何危险的事物都超感兴趣。看似白痴，却是一个大智若愚型的无愧船长之职的人。和其他传统的海贼所不同的是，他并不会为了追求财富而无故杀戮，而是享受着身为海贼的冒险');
INSERT INTO role VALUE
('NULL','罗罗诺亚·索隆','21岁',1,'草帽海贼团战斗员','东海·霜月村','睡觉、修炼、喝酒','世界第一大剑豪','无','3亿2000万','爱喝酒，爱睡觉，讲义气，海贼第一超级大路痴。为了小时候与挚友的约定而踏上了前往世界第一剑士的道路，随后成为路飞出海后遇到的第一个伙伴。在初次败给世界第一剑士“鹰眼米霍克”后向路飞发誓永不再败，并且更加努力的锻炼自己。两年后的他成功与伙伴们汇合，并且为了实现自己的梦想，奔赴强者如云的新世界');
INSERT INTO role VALUE
('NULL','娜美','20岁',0,'草帽海贼团航海士','东海▪可可亚西村','钱，橘子','绘制出自己的世界地图、绘制全世界的航海图','无','6600万','拥有橘色的短发（两年后为波浪长发）和左肩的刺青（风车与橘子的图案）。使用棍术，现在武器为“魔法天候棒”。头脑聪明又机灵，精通气象学和航海术，擅长偷术，能用身体感知天气，完美指示航路，是个能精确画出航海图的天才航海士。本质上是个细心、善良、重视感情、嫉恶如仇、偶尔有些温柔的能干的女性。最喜欢钱和橘子，梦想是要画出全世界的地图。');
INSERT INTO role VALUE
('NULL','乌索普','19岁',1,'草帽海贼团狙击手','东海▪西罗普村','发明各种东西、制造武器','成为勇敢的海上战士','无','2亿','特征为头戴狙击防风镜、浅啡色头巾，长鼻子。先前武器为弹弓“银河小弹珠”，后武器为提高了攻击性和准确度的独角仙弹弓，并用空岛的各种贝进行了强化。两年后武器为弹弓“黑兜”，并发射产自波音列岛的植物种子POP GREEN。小时候是出名的吹牛大王，和村里的几个孩子组成“乌索普海贼团”，自称乌索普船长。发现克洛船长的阴谋后，立志要保护村里的人，和路飞并肩作战。梦想是要成为勇敢的海上战士。');
INSERT INTO role VALUE
('NULL','山治','21岁',1,'草帽海贼团狙击手','东海▪西罗普村','发明各种东西、制造武器','成为勇敢的海上战士','无','2亿','特征为头戴狙击防风镜、浅啡色头巾，长鼻子。先前武器为弹弓“银河小弹珠”，后武器为提高了攻击性和准确度的独角仙弹弓，并用空岛的各种贝进行了强化。两年后武器为弹弓“黑兜”，并发射产自波音列岛的植物种子POP GREEN。小时候是出名的吹牛大王，和村里的几个孩子组成“乌索普海贼团”，自称乌索普船长。发现克洛船长的阴谋后，立志要保护村里的人，和路飞并肩作战。梦想是要成为勇敢的海上战士。');
INSERT INTO role VALUE
('NULL','托尼托尼·乔巴','17岁',1,'草帽海贼团船医','伟大航路·磁鼓岛','棉花糖，巧克力，所有甜的食物','成为万能药（不管什么病都能治的医生）','动物系·人人果实','100','原为磁鼓岛Dr.库蕾哈医生最宠爱的驯鹿兼医疗助手。乔巴的恩人是“庸医”希鲁鲁克医生，他身为野生驯鹿时本来没有名字，“乔巴”也是由希鲁鲁克给他命名的，意思是他有一对连树木都可以轻松砍倒的角。乔巴的特征是蓝色的鼻子和一顶画有“X”标记的粉红色帽子。本身很怕热，所以喜欢的岛屿是春天的冬岛。是草帽海贼团年龄最小的成员。人兽型的姿态下，则是伙伴中身材最矮小的成员。其梦想是成为“万能药”。（不管什么病都能治的医生）');
INSERT INTO role VALUE
('NULL','妮可·罗宾','30岁',0,'草帽海贼团考古学家','西海·奥哈拉岛','考古','寻找真正的“历史正文”，并且在历史正文碑的指引下，到达伟大航道的尽头“拉夫德鲁”','超人系▪花花果实','1亿3000万','年仅8岁就被悬赏千万的奥哈拉幸存者。在巴洛克解散后，加入草帽海贼团。个性冷静，擅长考古学以及暗杀，学识渊博，对于世界政府、海盗、航海一事都知道的很详细。目标是找到真正的历史正文，绝不饶恕践踏历史文物的人。');
INSERT INTO role VALUE
('NULL','弗兰奇','36岁',1,'草帽海贼团船工','南海','改造，建筑，研究武器','制造出梦想之船，在Sunny号完成后，想看到自己制造的船到达世界尽头而加入路飞一行','无','1亿3000万','性格豪放，喜欢唱歌，跳奇怪的舞，下身喜欢只穿一条短裤。身为改造人的弗兰奇，身体藏着各种兵器。弗兰奇在被CP9抓入司法岛的过程中被路飞他们救罗宾的精神所感动，义无返顾的站在路飞他们一边。司法岛事件结束后，弗兰奇用宝树亚当的材料建造了一艘梦想之船，取名“桑尼号（即万里阳光号）”，并赠送给草帽海贼团。后来在路飞的邀请下进入了草帽海贼团。弗兰奇本来是想制造出梦想之船，但“桑尼号”完成后，只想看到自己制造的船能到达世界尽头。');
INSERT INTO role VALUE
('NULL','布鲁克','90岁',1,'草帽海贼团音乐家','西海','演奏，喝红茶，牛奶，说骷髅冷笑话','环绕世界一周到伟大航道双子岬跟伙伴鲸鱼“拉布”重逢','超人系·黄泉果实','8300万','原本是某国护卫队团长，后加入伦巴海贼团，50年前跟鲸鱼拉布约定在“双子峡”重逢。后来在魔幻三角地带遇到敌人并遭遇毒手，因黄泉果实的能力，灵魂走出黄泉并准备回身体时，在魔幻三角地带迷路一年，找到的身体已变成骷髅，但爆炸头仍然存在，自此他只能以骷髅状态生存。幽灵岛战役结束后，从路飞口中得知伙伴拉布现在平安无事的消息，为了履行和拉布的约定，才正式加入草帽海贼团。');
INSERT INTO role VALUE
('NULL','甚平','46岁',1,'草帽海贼团舵手','鱼人岛','鱼人柔术、鱼人空手道、霸气','希望鱼人族与人类过上大同一家的生活','无','4亿以上','原为“王下七武海”，实力强劲，和火拳艾斯在伯仲之间。在费舍尔·泰格死后成为太阳海贼团的船长，后在蛋糕岛宣布加入草帽海贼团，在路飞激战卡塔库栗期间，承担起代理船长的责任，是海贼团的二号人物。和艾斯是肝胆相照的好兄弟，在顶上战争中和路飞相识，几次救过路飞的性命，并且在鱼人岛篇中打破传统为路飞输血，开启了人类和鱼人之间的桥梁。');

#趣味测试表
CREATE TABLE test1(
  resulta VARCHAR(500),
  resultb VARCHAR(500),
  resultc VARCHAR(500),
  resultd VARCHAR(500),
  resulte VARCHAR(500),
  result VARCHAR(500)
);
#插入数据
INSERT INTO test1 VALUE
('1','2','3','4','5','6');

#插入数据
INSERT INTO test1 VALUE
('1','2','3','4','5','6');
#创建交流表
CREATE TABLE talk(
  tid INT PRIMARY KEY AUTO_INCREMENT,
  tname VARCHAR(30),
  tcontent VARCHAR(300),
  tdate DATE
);
#插入测试数据
INSERT INTO talk VALUE
(NULL,'admin','测试留言内容','2018-12-6');




